Repository: mytonwallet-org/mytonwallet
Catalog: mobile/ios/Air/SubModules/WalletContext/Resources/Strings/*.lproj/LocalizableLegacy.strings
Languages: ar, ru

# Earn.WhyStakingIsSafeDesc
source: Staking is **fully decentralized** and operated by the **official TON Liquid Staking** smart contracts.|The deposited stake will be used for the TON network validation as part of its **proof-of-stake** essence.|You can withdraw your stake at **any time** and it will be deposited back to your account within **two days**.
ar: 1. الرهان متميز تمامًا ويتم تشغيله بواسطة عقود الرهان السائلة الرسمية لـ TON. 2. سيتم استخدام الرهان المودع لتحقيق شبكة TON كجزء من جوهرها لدعم الحصة. 3. يمكنك سحب رهانك في أي وقت وسيتم إيداعه مرة أخرى في حسابك خلال يومين.
ru: 1. Стейкинг полностью децентрализован и управляется официальными смарт-контрактами TON Liquid Staking. 2. Внесенный стейк будет использоваться для валидации сети TON в рамках ее сущности proof-of-stake. 3. Вы можете вывести свой стейк в любое время, и он будет возвращен на ваш счет в течение двух дней.

# Staking.AddStake
source: Add Stake
ar: إضافة رهان
ru: Добавить стейк

# Staking.Unstake
source: Unstake
ar: إلغاء الرهان

# Staking.StakingBalance
source: Staking Balance
ar: رصيد التوقيع المساحي
ru: Ставка баланса

# Staking.EstimatedBalanceInAYear
source: Est. balance in a year ≈
ar: الرصيد المقدر خلال السنة ≈
ru: Ожидаемый баланс через год ≈

# Staking.UseAll
source: Use All
ar: استخدام الكل
ru: Использовать все

# Staking.StakeTON
source: Stake TON
ar: رهان TON

# Staking.UnstakeTON
source: Unstake TON
ar: إلغاء الرهان TON

# Staking.ConfirmAddStake
source: Confirm Add Stake
ar: تأكيد إضافة الرهان
ru: Подтвердить добавление стейка

# Staking.ConfirmUnstake
source: Confirm Unstake
ar: تأكيد إلغاء الرهان
ru: Подтвердить unstake

# Staking.InsufficientBalance
source: Insufficient TON Balance
ar: رصيد TON غير كاف
ru: Недостаточный баланс TON

# Staking.InsufficientMinAmount
source: Minimum %1$@ TON
ar: الحد الأدنى %1$@ TON
ru: Минимум %1$@ TON

# Staking.InsufficientFeeAmount
source: Insufficient fee: %1$@ TON
ar: رسوم غير كافة: %1$@ TON
ru: Недостаточная комиссия: %1$@ TON

# QRScan.Title
source: Scan QR Code
ar: مسح رمز الاستجابة السريعة
ru: Сканировать QR-код

# QRScan.Back
source: Back
ar: رجوع
ru: Назад

# QRScan.NoAccessTitle
source: No Camera Access
ar: عدم وجود صلاحية للكاميرا
ru: Нет доступа к камере

# QRScan.NoAccessCamera
source: MyTonWallet doesn’t have access to the camera. Please enable camera access to scan QR codes.
ar: ليس لدى MyTonWallet الوصول إلى الكاميرا. يرجى تمكين الوصول إلى الكاميرا لمسح رموز الاستجابة السريعة.
ru: MyTonWallet не имеет доступа к камере. Пожалуйста, включите доступ к камере для сканирования QR-кодов.

# QRScan.NoAccessOpenSettings
source: Open Settings
ar: فتح الإعدادات
ru: Открыть настройки

# QRScan.NoValidQRDetected
source: This QR Code is not supported
ar: لم يتم اكتشاف رمز الاستجابة السريعة الصالح.
ru: Не обнаружен допустимый QR-код.

# Error.Title
source: Error
ar: خطأ
ru: Ошибка

# Error.InvalidAmount
source: Invalid amount
ar: مبلغ غير صالح
ru: Недопустимая сумма

# Error.InvalidAddress
source: Invalid address
ar: عنوان غير صالح
ru: Недопустимый адрес

# Error.InsufficientBalance
source: Insufficient balance
ar: الرصيد غير كافي
ru: Недостаточный баланс

# Error.DomainNotResolved
source: Domain is not connected to a wallet
ar: النطاق غير متصل بمحفظة
ru: Домен не подключен к кошельку

# Error.WalletNotInitialized
source: Encryption is not possible. The recipient is not a wallet or has no outgoing transactions.
ar: التشفير غير ممكن. المستلم ليس محفظة أو ليس لديه معاملات صادرة.
ru: Шифрование невозможно. Получатель не является кошельком или не имеет исходящих транзакций.

# Error.InvalidAddressFormat
source: Invalid address format. Only URL Safe Base64 format is allowed.
ar: تنسيق العنوان غير صالح. يُسمح فقط بتنسيق Base64 الآمن للرابط.
ru: Недопустимый формат адреса. Допустим только формат URL Safe Base64.

# Error.PartialTransactionFailure
source: Not all transactions were sent successfully.
ar: لم يتم إرسال جميع المعاملات بنجاح.
ru: Не все транзакции были успешно отправлены.

# Error.IncorrectDeviceTime
source: The time on your device is incorrect, sync it and try again.
ar: الوقت على جهازك غير صحيح، قم بمزامنته وحاول مرة أخرى.
ru: Неправильное время на вашем устройстве, синхронизируйте его и попробуйте снова.

# Error.UnsuccesfulTransfer
source: Transfer was unsuccessful. Try again later.
ar: فشلت عملية التحويل. حاول مرة أخرى لاحقًا.
ru: Перевод не удался. Попробуйте позже.

# Error.UnsupportedHardwareOperation
source: Unfortunately, this operation is not yet supported by Ledger wallet.
ar: للأسف، هذه العملية غير مدعومة حتى الآن بواسطة محفظة ليدجر.
ru: К сожалению, эта операция пока не поддерживается кошельком Ledger.

# Error.EncryptedDataNotSupported
source: Encrypted comments are not yet supported by Ledger.
ar: التعليقات المشفرة غير مدعومة حتى الآن بواسطة محفظة ليدجر.
ru: Зашифрованные комментарии пока не поддерживаются Ledger.

# Error.UnsupportedHardwareNftOperation
source: Transferring NFT is not yet supported by Ledger.
ar: تحويل NFT غير مدعوم حتى الآن بواسطة محفظة ليدجر.
ru: Передача NFT пока не поддерживается Ledger.

# Error.UnsupportedHardwareContract
source: Transaction to this smart contract is not yet supported by Ledger.
ar: المعاملة إلى هذا العقد الذكي غير مدعومة حتى الآن بواسطة محفظة ليدجر.
ru: Транзакция с этим смарт-контрактом пока не поддерживается Ledger.

# Error.NonAsciiCommentForHardwareOperation
source: The current version of Ledger only supports English-language comments without special characters.
ar: الإصدار الحالي من ليدجر يدعم فقط التعليقات باللغة الإنجليزية بدون أحرف خاصة.
ru: Текущая версия Ledger поддерживает только комментарии на английском языке без специальных символов.

# Error.TooLongCommentForHardwareOperation
source: Comment is too long.
ar: التعليق طويل جدًا.
ru: Комментарий слишком длинный.

# Error.UnsupportedHardwarePayload
source: This type of transaction is not yet supported by Ledger.
ar: هذا النوع من المعاملات غير مدعوم حتى الآن بواسطة محفظة ليدجر.
ru: Этот тип транзакции пока не поддерживается Ledger.

# Error.ServerError
source: Please make sure your internet connection is working and try again.
ar: يرجى التأكد من أن اتصال الإنترنت الخاص بك يعمل وحاول مرة أخرى.
ru: Пожалуйста, убедитесь, что ваше интернет-соединение работает, и попробуйте снова.

# Error.NetworkError
source: No internet connection. Please check your connection and try again.
ar: لا يوجد اتصال بالإنترنت. يرجى التحقق من اتصالك والمحاولة مرة أخرى.
ru: Нет интернет-соединения. Проверьте соединение и попробуйте снова.

# Error.DebugError
source: Unexpected error. Please let the support know.
ar: خطأ غير متوقع. يرجى إعلام الدعم.
ru: Неожиданная ошибка. Пожалуйста, сообщите об этом в поддержку.

# Error.Unexpected
source: Unexpected
ar: غير متوقع
ru: Неожиданная ошибка
