Repository: mytonwallet-org/mytonwallet
Catalog: mobile/ios/Air/SubModules/WalletContext/Resources/Strings/*.lproj/LocalizableLegacy.strings
Languages: ar, ru

# Alert.OK
source: OK
ar: حسناً
ru: ОК

# Alert.NetworkErrorTitle
source: Network error
ar: خطأ في الشبكة
ru: Ошибка сети

# Alert.NetworkErrorText
source: Please make sure your internet connection is working and try again.
ar: يرجى التأكد من أن اتصال الإنترنت الخاص بك يعمل وحاول مرة أخرى.
ru: Пожалуйста, убедитесь, что ваше интернет-соединение работает, и попробуйте еще раз.

# Intro.Title
source: MyTonWallet
ar: محفظتي تون

# Intro.Text
source: Securely store and send crypto.
ar: قم بتخزين العملات الرقمية وإرسالها بشكل آمن.
ru: Безопасно храните и отправляйте криптовалюту.

# Intro.CreateWallet
source: Create My Wallet
ar: إنشاء محفظتي
ru: Создать кошелек

# Intro.ImportExisting
source: Import Existing Wallet
ar: استيراد محفظة موجودة
ru: Импортировать существующий кошелек

# Intro.CreateErrorTitle
source: An Error Occurred
ar: حدث خطأ
ru: Произошла ошибка

# Intro.CreateErrorText
source: Sorry. Please try again.
ar: عذرًا. يرجى المحاولة مرة أخرى.
ru: Извините. Пожалуйста, попробуйте еще раз.

# Created.Title
source: Wallet Created
ar: تهانينا
ru: Поздравляем

# Created.Text
source: Your TON Wallet has just been created.
ar: تم إنشاء محفظة TON الخاصة بك للتو. أنت الوحيد الذي يتحكم فيها. لتكون قادرًا دائمًا على الوصول إليها، يرجى كتابة الكلمات السرية الخاصة بك و إعداد رمز مرور آمن.
ru: Ваш TON кошелек создан. Только вы контролируете его. Чтобы всегда иметь доступ к нему, запишите свои секретные слова и установите надежный пароль.

# Created.Proceed
source: Proceed
ar: متابعة
ru: Продолжить

# Words.Title
source: Your Recovery Phrase
ar: عبارة استعادة الخاصة بك
ru: Ваша фраза восстановления

# Words.Text
source: Write down these 24 words in this exact order and keep them in a secure place. Do not share this list with anyone. If you lose it, you will irrevocably lose access to your TON account.
ar: قم بكتابة هذه الكلمات الـ 24 بهذا الترتيب الدقيق واحتفظ بها في مكان آمن. لا تشارك هذه القائمة مع أي شخص. إذا فقدتها، ستفقد الوصول إلى حساب TON الخاص بك نهائيًا.
ru: Запишите эти 24 слова в точном порядке и храните их в надежном месте. Не делитесь этим списком ни с кем. Если вы потеряете его, вы навсегда потеряете доступ к своему TON аккаунту.

# Words.Done
source: Done
ar: تم
ru: Готово

# Words.NotDoneTitle
source: Sure Done?
ar: هل متأكد من الانتهاء؟
ru: Уверены, что закончили?

# Words.NotDoneText
source: You didn't have enough time to write those words down.
ar: لم تكن لديك ما يكفي من الوقت لكتابة تلك الكلمات.
ru: У вас не было достаточно времени, чтобы записать эти слова.

# Words.NotDoneOk
source: OK
ar: حسنًا، آسف
ru: ОК, извините

# Words.NotDoneResponse
source: Apologies Accepted
ar: الاعتذار مقبول
ru: Извинения приняты

# Words.NotDoneSkip
source: Skip
ar: تخطى
ru: Пропустить

# WordCheck.Title
source: Test Time!
ar: وقت الاختبار!
ru: Время проверки!

# WordCheck.Text
source: Let’s check that you wrote them down correctly. Please enter the words %1$@, %2$@ and %3$@.
ar: لنتأكد من أنك كتبتها بشكل صحيح. يرجى إدخال الكلمات %1$@، %2$@ و %3$@.
ru: Давайте проверим, правильно ли вы записали слова. Пожалуйста, введите слова %1$@, %2$@ и %3$@.

# WordCheck.Continue
source: Continue
ar: متابعة
ru: Продолжить

# WordCheck.IncorrectHeader
source: Incorrect words
ar: كلمات غير صحيحة
ru: Неправильные слова

# WordCheck.IncorrectText
source: The secret words you have entered do not match the ones in the list.
ar: الكلمات السرية التي أدخلتها لا تتطابق مع تلك الموجودة في القائمة.
ru: Введенные вами секретные слова не совпадают с указанными в списке.

# WordCheck.TryAgain
source: Try again
ar: حاول مرة اخرى
ru: Попробовать снова

# WordCheck.ViewWords
source: See words
ar: رؤية الكلمات
ru: Посмотреть слова

# WordImport.Title
source: 24 Secret Words
ar: 24 كلمة سرية
ru: 24 секретных слова

# WordImport.Text
source: You can restore access to your wallet by entering 24 words you wrote when down you creating the wallet.
ar: يمكنك استعادة وصولك إلى محفظتك عن طريق إدخال 24 كلمة كتبتها عند إنشاء المحفظة.
ru: Вы можете восстановить доступ к своему кошельку, введя 24 слова, которые вы записали при создании кошелька.

# WordImport.Continue
source: Continue
ar: متابعة
ru: Продолжить

# WordImport.CanNotRemember
source: I don't have those
ar: ليس لدي تلك
ru: Я не помню их

# WordImport.IncorrectTitle
source: Wrong Phrase
ar: عبارة خاطئة
ru: Неправильная фраза

# WordImport.IncorrectText
source: Looks like you entered an invalid mnemonic phrase.
ar: يبدو أنك قمت بإدخال عبارة من الذاكرة غير صالحة.
ru: Похоже, вы ввели неверную мнемоническую фразу.

# WordImport.UnknownErrorTitle
source: Import failed
ar: فشل الاستيراد
ru: Не удалось импортировать

# WordImport.UnknownErrorText
source: Please try again.
ar: يرجى المحاولة مرة أخرى.
ru: Пожалуйста, попробуйте еще раз.

# WordImport.Importing
source: Please wait...
ar: يرجى الانتظار...
ru: Пожалуйста, подождите...

# ImportSuccessful.Title
source: Your wallet has just been imported!
ar: لقد تم استيراد محفظتك للتو!
ru: Ваш кошелек был успешно импортирован!

# SetPasscode.Title
source: Set a Passcode
ar: تعيين رمز مرور
ru: Установите пароль

# SetPasscode.Text
source: Enter the %1$@ digits in the passcode.
ar: أدخل الأرقام %1$@ في الرمز المروري.
ru: Введите %1$@ цифры пароля.

# SetPasscode.FourDigitCode
source: Use 4-digit Passcode
ar: استخدم رمز مرور مكون من 4 أرقام
ru: Использовать 4-значный пароль

# SetPasscode.SixDigitCode
source: Use 6-digit Passcode
ar: استخدم رمز مرور مكون من 6 أرقام
ru: Использовать 6-значный пароль

# SetPasscode.PasscodesDoNotMatch
source: Passcodes don't match. Please try again.
ar: الرموز المرورية غير متطابقة. يرجى المحاولة مرة أخرى.
ru: Пароли не совпадают. Пожалуйста, попробуйте еще раз.

# ConfirmPasscode.Title
source: Confirm a Passcode
ar: تأكيد الرمز المرور
ru: Подтвердите пароль

# ConfirmPasscode.Text
source: Re-enter the %1$@ digits in the passcode.
ar: أدخل الأرقام %1$@ في الرمز المروري.
ru: Введите %1$@ цифры пароля.

# ChangePasscode.Title
source: Enter your current passcode
ar: أدخل الرمز المرور الحالي الخاص بك
ru: Введите текущий пароль

# ChangePasscode.NewPassTitle
source: Set a passcode
ar: تعيين رمز مرور جديد
ru: Установите пароль

# ChangePasscode.NewPassVerifyTitle
source: Confirm a passcode
ar: تأكيد الرمز المرور
ru: Подтвердите пароль

# Biometric.Reason
source: MyTonWallet uses biometric authentication to unlock and authorize transactions
ar: تستخدم محفظة TON المصادقة البيومترية لتفويض المعاملات
ru: TON Wallet использует биометрическую аутентификацию для авторизации транзакций

# Biometric.NotAvailableTitle
source: Biometric authentication not available.
ar: المصادقة البيومترية غير متوفرة.
ru: Биометрическая аутентификация недоступна.

# Biometric.NotAvailableText
source: Please set a passcode on your device, and then try to use biometric authentication.
ar: يرجى تعيين رمز مرور على جهازك، ثم حاول استخدام المصادقة البيومترية.
ru: Пожалуйста, установите пароль на вашем устройстве, а затем попробуйте использовать биометрическую аутентификацию.

# Biometric.FaceID.Title
source: Enable Face ID
ar: تمكين Face ID
ru: Включить Face ID

# Biometric.FaceID.Text
source: Face ID allows you to open your wallet faster without having to enter your password.
ar: Face ID يسمح لك بفتح محفظتك بشكل أسرع دون الحاجة لإدخال كلمة المرور.
ru: Face ID позволяет вам быстрее открывать свой кошелек, не вводя пароль.

# Biometric.FaceID.Enable
source: Enable Face ID
ar: تمكين Face ID
ru: Включить Face ID

# Biometric.FaceID.Skip
source: Skip
ar: تخطي
ru: Пропустить

# Biometric.TouchID.Title
source: Enable Touch ID
ar: تمكين Touch ID
ru: Включить Touch ID

# Biometric.TouchID.Text
source: Touch ID allows you to open your wallet faster without having to enter your password.
ar: Touch ID يسمح لك بفتح محفظتك بشكل أسرع دون الحاجة لإدخال كلمة المرور.
ru: Touch ID позволяет вам быстрее открывать свой кошелек, не вводя пароль.

# Biometric.TouchID.Enable
source: Enable Touch ID
ar: تمكين Touch ID
ru: Включить Touch ID

# Biometric.TouchID.Skip
source: Skip
ar: تخطي
ru: Пропустить

# Completed.Title
source: Ready to go!
ar: جاهز للانطلاق!
ru: Все готово!

# Completed.Text
source: You’re all set. Now you have a wallet that only you control - directly, without middlemen or bankers.
ar: لقد أكملت الآن. الآن لديك محفظة تتحكم فيها فقط - مباشرة، بدون وسطاء أو مصرفيين.
ru: Теперь у вас есть кошелек, который контролируете только вы - напрямую, без посредников и банкиров.

# Completed.ViewWallet
source: View my wallet
ar: عرض محفظتي
ru: Просмотреть мой кошелек

# RestoreFailed.Title
source: Too Bad!
ar: من المؤسف!
ru: Очень жаль!

# RestoreFailed.Text
source: Without the secret words you can't restore access to your wallet.
ar: بدون الكلمات السرية لا يمكنك استعادة الوصول إلى محفظتك.
ru: Без секретных слов вы не сможете восстановить доступ к своему кошельку.

# RestoreFailed.EnterWords
source: Enter 24 words
ar: أدخل 24 كلمة
ru: Введите 24 слова

# RestoreFailed.CreateWallet
source: Create a new empty wallet instead
ar: إنشاء محفظة جديدة فارغة بدلاً من ذلك
ru: Создать новый пустой кошелек вместо этого

# Navigation.Cancel
source: Cancel
ar: إلغاء
ru: Отмена

# Navigation.Done
source: Done
ar: تم
ru: Готово

# Unlock.Title
source: Enter your Wallet Passcode
ar: أدخل رمز مرور محفظتك
ru: Введите пароль от вашего кошелька

# Tabs.Home
source: Wallet
ar: الرئيسية
ru: Главная

# Tabs.Assets
source: Assets
ar: الأصول
ru: Активы

# Tabs.Browser
source: Explore
ar: المتصفح
ru: Браузер

# Tabs.Settings
source: Settings
ar: الإعدادات
ru: Настройки

# Home.WaitingForNetwork
source: Waiting for network…
ar: في انتظار الشبكة
ru: Ожидание сети

# Home.Updating
source: Updating…
ar: تحديث
ru: Обновление

# Home.MainWallet
source: My Wallet
ar: محفظتي
ru: Мой кошелек

# Home.Add
source: add
ar: إضافة
ru: добавить

# Home.Send
source: send
ar: إرسال
ru: отправить

# Home.Earn
source: earn
ar: كسب
ru: заработать

# Home.Earn.Unstaking
source: unstaking
ar: الغاء الرهان
ru: вывод

# Home.Earn.Earning
source: earning
ar: الربح
ru: заработок

# Home.Swap
source: swap
ar: تبادل
ru: обмен

# Home.WalletCreated
source: You have no transactions yet.
ar: ليس لديك معاملات بعد.
ru: У вас пока нет транзакций.

# Home.Sent
source: Sent
ar: تم الإرسال
ru: Отправлено

# Home.Received
source: Received
ar: تم الاستلام
ru: Получено

# Home.SentNFT
source: Sent NFT
ar: تم إرسال NFT
ru: Отправлено NFT

# Home.ReceivedNFT
source: Received NFT
ar: تم استلام NFT
ru: Получено NFT

# Home.Staked
source: Staked
ar: تم الرهان
ru: Ставка

# Home.Unstaked
source: Unstaked
ar: تم الغاء الرهان
ru: Вывод ставки

# Home.UnstakeRequest
source: Unstake Requested
ar: طلب الغاء الرهان
ru: Запрос на вывод ставки

# Home.BuyWithCard
source: Buy with Card
ar: شراء ببطاقة
ru: Купить с карты

# Home.BuyWithCrypto
source: Buy with Crypto
ar: شراء بعملة معماة
ru: Купить за криптовалюту

# Home.ReceiveQR
source: Receive with QR or Invoice
ar: استلام بواسطة رمز الاستجابة السريعة أو الفاتورة
ru: Получить по QR или инвойсу

# Home.Cancel
source: Cancel
ar: إلغاء
ru: Отмена

# Home.EnterWalletName
source: Enter wallet name:
ar: أدخل اسم المحفظة
ru: введите имя кошелька

# Receive.Title
source: Add Crypto
ar: إضافة عملة معماة
ru: Добавить криптовалюту

# Receive.CopyAddress
source: Copy Address
ar: نسخ العنوان
ru: Скопировать адрес

# Receive.ShareQRCode
source: Share QR Code
ar: مشاركة رمز الاستجابة السريعة
ru: Поделиться QR-кодом

# Receive.BuyCrypto
source: BUY CRYPTO
ar: شراء عملة معماة
ru: КУПИТЬ КРИПТО

# Receive.BuyWithCard
source: Buy with Card
ar: شراء ببطاقة
ru: Купить с карты

# Receive.BuyWithCrypto
source: Buy with Crypto
ar: شراء بعملة معماة
ru: Купить за криптовалюту

# Settings.Title
source: Settings
ar: إعدادات المحفظة
ru: Настройки кошелька

# Settings.DeleteWallet
source: Remove Wallet
ar: حذف المحفظة
ru: Удалить кошелек

# Settings.DeleteWalletInfo
source: This will disconnect the wallet from this app. You will be able to restore your wallet using 24 secret words – or import another wallet. TON Wallets are located in the decentralized TON Blockchain. If you want a wallet to be deleted, simply transfer all the TON from it and leave it empty.
ar: سيؤدي هذا إلى فصل المحفظة عن هذا التطبيق. يمكنك استعادة محفظتك باستخدام 24 كلمة سرية - أو استيراد محفظة أخرى. تقع محافظ TON في سلسلة الكتل اللامركزية TON. إذا كنت ترغب في حذف محفظة ، فقم ببساطة بتحويل جميع TON منها واتركها فارغة.
ru: Это отключит кошелек от этого приложения. Вы сможете восстановить ваш кошелек, используя 24 секретных слова, или импортировать другой кошелек. Кошельки TON находятся в децентрализованной сети TON Blockchain. Если вы хотите удалить кошелек, просто переведите все TON и оставьте его пустым.

# Settings.Language
source: Language
ar: اللغة
ru: Язык

# Time.Today
source: Today
ar: اليوم
ru: Сегодня

# TransactionInfo.SentTitle
source: Sent
ar: تم الإرسال
ru: Отправлено

# TransactionInfo.ReceivedTitle
source: Received
ar: تم الاستلام
ru: Получено

# TransactionInfo.SwapTitle.Completed
source: Swapped
ar: تم التبادل
ru: Обмен завершен

# TransactionInfo.SwapTitle.Pending
source: Swap in progress
ar: تبادل قيد التقدم
ru: Обмен в процессе

# TransactionInfo.SwapTitle.Failed
source: Failed swap
ar: فشل التبادل
ru: Неудачный обмен

# TransactionInfo.SwapTitle.Expired
source: Expired swap
ar: انتهى التبادل
ru: Срок действия обмена истек

# TransactionInfo.ExchangeRate
source: Exchange Rate
ar: سعر الصرف
ru: Курс обмена

# TransactionInfo.ChangellyPaymentAddress
source: Changelly Payment Address
ar: عنوان الدفع لـ Changelly
ru: Адрес для оплаты Changelly

# TransactionInfo.Comment
source: COMMENT
ar: تعليق
ru: КОММЕНТАРИЙ

# TransactionInfo.Details
source: Transaction details
ar: تفاصيل المعاملة
ru: ДЕТАЛИ ТРАНЗАКЦИИ

# TransactionInfo.SenderAddress
source: Sender
ar: المُرسِل
ru: Отправитель

# TransactionInfo.Recipient
source: Recipient
ar: المُستلم
ru: Получатель

# TransactionInfo.Amount
source: Amount
ar: المبلغ
ru: Сумма

# TransactionInfo.Fee
source: Fee
ar: الرسوم
ru: Комиссия

# TransactionInfo.ViewInExplorer
source: View in Explorer
ar: عرض في المستكشف
ru: Просмотреть в проводнике

# TransactionInfo.ReceivedNFT
source: Received NFT
ar: تم استلام NFT
ru: Получено NFT

# TransactionInfo.EncryptedComment
source: Encrypted comment
ar: تعليق مشفر
ru: зашифрованное сообщение

# TransactionInfo.Decrypt
source: Decrypt
ar: فك التشفير
ru: расшифровать

# SendCurrency.ChooseCurrency
source: Choose Currency
ar: اختيار العملة
ru: Выберите валюту

# SendTo.Title
source: Send
ar: إرسال
ru: Отправить

# SendTo.To
source: To:
ar: إلى:
ru: Кому:

# SendTo.AddressOrDomain
source: Address or domain
ar: العنوان أو النطاق
ru: Адрес или домен

# SendTo.Recent
source: Recent
ar: المؤخرة
ru: Недавние

# SendTo.Wallet
source: Wallet
ar: المحفظة
ru: Кошелек

# SendAmount.Title
source: Send
ar: إرسال
ru: Отправить

# SendAmount.Continue
source: Continue
ar: متابعة
ru: Продолжить

# SendAmount.InsufficientBalance
source: Insufficient %1$@ Balance
ar: رصيد غير كافي من %1$@
ru: Недостаточный баланс %1$@

# SendAmount.Warning
source: Warning!
ar: تحذير!
ru: Предупреждение!

# SendAmount.SendingImportantToken
source: You are about to transfer an important service token, which is needed to withdraw your deposit from staking.
ar: أنت على وشك تحويل رمز خدمة مهم، والذي يُطلب لسحب إيداعك من الرهن.
ru: Вы собираетесь перевести важный служебный токен, который нужен для вывода вашего депозита из стекинга.

# SendConfirm.Title
source: Send
ar: إرسال
ru: Отправить

# SendConfirm.Message
source: MESSAGE
ar: رسالة
ru: СООБЩЕНИЕ

# SendConfirm.AddComment
source: Add a message, if needed
ar: إضافة تعليق إذا لزم الأمر
ru: Добавить комментарий, если нужно

# SendConfirm.EncryptComment
source: Encrypt comment
ar: تشفير التعليق
ru: Зашифровать комментарий

# SendConfirm.Details
source: TRANSACTION DETAILS
ar: تفاصيل المعاملة
ru: ДЕТАЛИ ТРАНЗАКЦИИ

# SendConfirm.Recipient
source: Recipient
ar: المُستلم
ru: Получатель

# SendConfirm.RecipientAddress
source: Recipient address
ar: عنوان المُستلم
ru: Адрес получателя

# SendConfirm.Amount
source: Amount
ar: المبلغ
ru: Сумма

# SendConfirm.Fee
source: Fee
ar: الرسوم
ru: Комиссия

# SendConfirm.Confirm
source: Send
ar: إرسال
ru: Отправить

# SendConfirm.ConfirmAmountAndAddress
source: %1$@ to %2$@
ar: %1$@ إلى %2$@
ru: %1$@ для %2$@

# SendConfirm.ConfirmSend
source: Confirm Sending
ar: تأكيد الإرسال
ru: Подтвердить отправку

# Sent.Details
source: Transaction Details
ar: تفاصيل المعاملة
ru: Детали транзакции

# Sent.Close
source: Close
ar: إغلاق
ru: Закрыть

# SwitchAccount.Add
source: Add Account
ar: إضافة حساب
ru: Добавить аккаунт

# SwitchAccount.CreateNewWallet
source: Create New Wallet
ar: إنشاء محفظة جديدة
ru: Создать новый кошелек

# SwitchAccount.ImportWallet
source: Import Wallet
ar: استيراد المحفظة
ru: Импортировать кошелек

# SwitchAccount.Cancel
source: Cancel
ar: إلغاء
ru: Отмена

# Swap.Title
source: Swap
ar: تبديل
ru: Обмен

# Swap.YouSell
source: You sell
ar: تبيع
ru: Вы продаете

# Swap.YouBuy
source: You buy
ar: تشتري
ru: Вы покупаете

# Swap.Max
source: Max
ar: الحد الأقصى
ru: Макс

source: Swap Details
ar: تفاصيل التبادل
ru: Детали обмена

# Swap.PricePer
source: Price per 1 %1$@
ar: السعر لكل %1$@
ru: Цена за 1 %1$@

# Swap.BlockchainFee
source: Blockchain Fee
ar: رسوم البلوكشين
ru: Комиссия блокчейна

# Swap.RoutingFees
source: Routing Fees
ar: رسوم التوجيه
ru: Комиссии за маршрутизацию

# Swap.Included
source: Included
ar: متضمنة
ru: Включено

# Swap.PriceImpact
source: Price Impact
ar: تأثير السعر
ru: Влияние на цену

# Swap.PriceImpactInfo
source: This shows how much your trade might change the token price. Big trades can make the price go up or down more. Lower is usually better.
ar: يظهر هذا مقدار تغيير تداولك لسعر الرمز. الصفقات الكبيرة قد تجعل السعر يرتفع أو ينخفض بشكل أكبر. القيمة الأقل عادة ما تكون أفضل.
ru: Показывает, насколько ваша сделка может изменить цену токена. Крупные сделки могут сильнее повлиять на изменение цены. Обычно, чем ниже, тем лучше.

# Swap.MinimumReceived
source: Minimum Received
ar: الحد الأدنى المستلم
ru: Минимум получено

# Swap.EnterAmounts
source: Enter Amounts
ar: أدخل المبالغ
ru: Введите суммы

# Swap.Submit
source: Swap %1$@ to %2$@
ar: تبديل %1$@ إلى %2$@
ru: Обменять %1$@ на %2$@

# Swap.Unavailable
source: Unavailable
ar: غير متوفر
ru: Недоступно

# Swap.Minimum
source: Minimum
ar: الحد الأدنى
ru: Минимум

# Swap.Maximum
source: Maximum
ar: الحد الأقصى
ru: Максимум

# Swap.InsufficientBalance
source: Insufficient %1$@ Balance
ar: رصيد %1$@ غير كافٍ
ru: Недостаточный баланс %1$@

# Swap.Confirm
source: Confirm Swap
ar: تأكيد التبديل
ru: Подтвердить обмен

# Swap.ConfirmSubtitle
source: %1$@ to %2$@
ar: %1$@ إلى %2$@
ru: %1$@ на %2$@

# Swap.InvalidPair
source: Invalid Pair
ar: زوج غير صالح
ru: Недопустимая пара

# Swap.Continue
source: Continue
ar: متابعة
ru: Продолжить

# Swap.CrossChainDetails
source: By continuing, you agree to terms of use and privacy policy and understand that the transaction may trigger verification according to Changelly AML/KYC.
ar: تبادل بين الشبكات عبر Changelly من خلال المتابعة، أنت توافق على شروط الاستخدام وسياسة الخصوصية وتفهم أن العملية قد تؤدي إلى تنفيذ التحقق وفقًا لسياسة مكافحة غسيل الأموال/معرفة العميل لـ Changelly.
ru: Межцепочечный обмен от Changelly Продолжая, вы соглашаетесь с условиями использования и политикой конфиденциальности и понимаете, что транзакция может вызвать проверку в соответствии с AML/KYC Changelly.

# Swap.CrossChainHighlights
source: terms of use|privacy policy|Changelly AML/KYC
ar: شروط الاستخدام|سياسة الخصوصية|Changelly AML/KYC
ru: условия использования|политика конфиденциальности|AML/KYC Changelly

# SwapToken.MyAssets
source: My assets
ar: أصولي
ru: Мои активы

# SwapToken.Popular
source: Popular
ar: شائع
ru: Популярное

# SwapToken.YouSell
source: You Sell
ar: تبيع
ru: Вы продаете

# SwapToken.YouBuy
source: You Buy
ar: تشتري
ru: Вы покупаете

# SwapToken.All
source: A ~ Z
ar: الجميع
ru: все

# CrossChainSwap.ReceiveTo
source: RECEIVE TO
ar: استلم إلى
ru: ПОЛУЧИТЬ НА

# CrossChainSwap.EnterChainAddress
source: Enter %1$@ address
ar: أدخل عنوان %1$@
ru: Введите адрес %1$@

# CrossChainSwap.Paste
source: Paste
ar: الصق
ru: Вставить

# CrossChainSwap.FromTonDescription
source: Please provide an address of your wallet in another blockchain to receive bought tokens.
ar: يرجى تقديم عنوان محفظتك في سلسلة كتلية أخرى لاستلام الرموز المشتراة.
ru: Пожалуйста, укажите адрес вашего кошелька в другой блокчейн, чтобы получить купленные токены.

# CrossChainSwap.EnterReceivingAddress
source: Enter Receiving Address
ar: أدخل عنوان الاستلام
ru: Введите адрес получения

# CrossChainSwap.SendToThisAddress
source: SEND %1$@ TO THIS ADDRESS
ar: أرسل %1$@ إلى هذا العنوان
ru: ОТПРАВЬТЕ %1$@ НА ЭТОТ АДРЕС

# CrossChainSwap.ShowQR
source: SHOW QR
ar: عرض رمز الاستجابة السريعة
ru: ПОКАЗАТЬ QR

# CrossChainSwap.HideQR
source: HIDE QR
ar: إخفاء رمز الاستجابة السريعة
ru: СКРЫТЬ QR

# CrossChainSwap.ToTonDescription
source: Please note that it may take up to a few hours for tokens to appear in your wallet. If there are any problems, please contact support at Changelly Live Chat or support@changelly.org and provide your Transaction ID.
ar: أرسل %1$@ إلى هذا العنوان في سلسلة الكتل %2$@ خلال %3$@. يرجى ملاحظة أنه قد يستغرق بضع ساعات حتى تظهر الرموز في محفظتك. إذا كانت هناك أي مشاكل، يرجى الاتصال بالدعم في الدردشة المباشرة لـ Changelly أو عن طريق البريد الإلكتروني support@changelly.org وتقديم معرف المعاملة الخاص بك: %4$@
ru: Отправьте %1$@ на этот адрес в блокчейне %2$@ в течение %3$@. Обратите внимание, что может потребоваться несколько часов, чтобы токены появились в вашем кошельке. Если возникнут проблемы, свяжитесь с поддержкой в Changelly Live Chat или по адресу support@changelly.org и предоставьте свой идентификатор транзакции: %4$@

# CrossChainSwap.ToTonDescriptionHighlights
source: Changelly Live Chat|support@changelly.org
ar: دردشة مباشرة لـ Changelly|support@changelly.org

# Earn.Title
source: Earn
ar: الربح
ru: Заработок

# Earn.YourStakingBalance
source: Your staking balance
ar: رصيدك في الرهان
ru: Ваш баланс стейкинга

# Earn.UnstakeRequestInfo
source: You will receive your unstaked deposit in %1$@.
ar: ستتلقى إيداع الرهان الخاص بك الغير المرهون في %1$@.
ru: Вы получите свой unstaked депозит через %1$@.

# Earn.AddStake
source: Add Stake
ar: إضافة رهان
ru: Добавить стейк

# Earn.Unstake
source: Unstake
ar: إلغاء الرهان

# Earn.History
source: History
ar: التاريخ
ru: История

# Earn.Earned
source: Earned
ar: المكتسب
ru: Заработано

# Earn.Unstaked
source: Unstaked
ar: الرهان الغير المرهون
ru: Нестационарный

# Earn.Staked
source: Staked
ar: الرهان المرهون
ru: Ставка

# Earn.EarnWhileHolding
source: Earn from your tokens while holding them
ar: اربح من الرموز الخاصة بك أثناء احتفاظك بها
ru: Зарабатывайте на своих токенах пока держите их

# Earn.EstimatedAPY
source: Estimated APY
ar: العائد التقريبي السنوي
ru: Ожидаемый APY

# Earn.UnstakeRequest
source: Unstake request
ar: طلب إلغاء الاشتراك
ru: Запрос на разстейк

# Earn.WhyThisIsSafe
source: Why This is Safe
ar: لماذا هذا آمن
ru: Почему это безопасно

# Earn.WhyStakingIsSafe
source: Why Staking is Safe
ar: لماذا الرهان آمن
ru: Почему стейкинг безопасен
